// - створити функцію яка обчислює та повертає площу прямокутника зі сторонами а і б
const  square = (a,b) =>a+b;
console.log(square(5, 5));
// -------------------------------------------------------------------------------------------------
// - створити функцію яка обчислює та повертає площу кола з радіусом r
function calculateSquare(radius) {
    return  Math.PI * radius ** 2;
}
console.log(calculateSquare(2));
// -------------------------------------------------------------------------------------------------
// - створити функцію яка обчислює та повертає площу циліндру висотою h, та радіутом r
function cylinder (r,h){
    return  Math.PI * r ** 2 * h;
}
console.log(cylinder(2, 2));
// -------------------------------------------------------------------------------------------------
// - створити функцію яка приймає масив та виводить кожен його елемент
function massif(arr){
    for(const item of arr){
        console.log(item);
    }
}
massif([1,2,3]);
// -------------------------------------------------------------------------------------------------
// - створити функцію яка створює параграф з текстом. Текст задати через аргумент
function paragraf(text){
    document.write(`<p>${text}</p>`);
}
paragraf('olala');
// -------------------------------------------------------------------------------------------------
// - створити функцію яка створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий
function ul(text) {
    document.write(`<ul><li>${text}</li><li>${text}</li><li>${text}</li></ul>`)
}
ul('Olaf!');
// -------------------------------------------------------------------------------------------------
// - створити функцію яка створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий.
// Кількість li визначається другим аргументом, який є числовим (тут використовувати цикл)
function ul2(text,number) {
    document.write(`<ul>`)
    for (let i=0;i<number;i++){
        document.write(`<li>${text}</li>`);
    }
    document.write(`</ul>`)
}
ul2('Shrek',5);
// -------------------------------------------------------------------------------------------------
// - створити функцію яка приймає масив примітивних елементів (числа,стрінги,булеві), та будує для них список
function element(arr){
    document.write(`<ul>`)
    for (const item of arr){
        document.write(`<li>${item}</li>`);
    }
    document.write(`</ul>`)
}
element([1, 2, true, false,"str"]);
// -------------------------------------------------------------------------------------------------
// - створити функцію яка приймає масив об'єктів з наступними полями id,name,age ,та виводить їх в документ.
// Для кожного об'єкту окремий блок.
let usersWithId = [
    {id: 1, name: 'vasya', age: 31 },
    {id: 2, name: 'petya', age: 30 },
    {id: 3, name: 'kolya', age: 29 },
    {id: 4, name: 'olya', age: 28 }
];
function user(arr){
    for (const user of arr){
        document.write(`<div>${user.id} - ${user.name} - ${user.age}</div>`);
    }
}
user(usersWithId);
// -------------------------------------------------------------------------------------------------
// - створити функцію яка повертає найменьше число з масиву
const funMin = (array) => {
    let min = array[0];
    for (const funMinElement of array) {
        if (funMinElement < min) min = funMinElement;
        }
    return min;
}
console.log(funMin([2, 3, 4, -5, 6, 10, 4, -3, 6]));
// -------------------------------------------------------------------------------------------------
// - створити функцію яка приймає масив чисел, сумує значення елементів масиву та повертає його.
// Приклад [1,2,10]->13
function arr(arr){
    let sum = 0;
    for (const item of arr){
        sum+=item;
    }
    return sum;
}
console.log(arr([1,2,10]));